# 4. Приемы работы с библиотекой BeautifulSoup
#
# https://www.youtube.com/watch?v=3hgkiDAaSQs
#
# В этом видео на более абстрактном примере локальной страницы даны дополнительные примеры работы методов find и find_all
# библиотеки BeautifulSoup. Показывается, как находить включающие информацию блоки при помощи методов parent, find_parent
# и find_parents. Описаны особенности работы методов next_element и next_sibling, упрощающих поиск данных в пределах
# одного раздела. В конце видео рассматривается, как сочетать поиск в BeautifulSoup с регулярными выражениями.